Autodesk.Navisworks.Api.VertexProperties
Vertex properties enumeration.

Autodesk.Navisworks.Api.VertexProperties.None
None

Autodesk.Navisworks.Api.VertexProperties.HasNormals
Normals

Autodesk.Navisworks.Api.VertexProperties.HasColors
Colours

Autodesk.Navisworks.Api.VertexProperties.HasTextureCoordinates
Texture co-ordinates